{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Hello",
        "Good day",
        "What's up",
        "Hey there"
      ],
      "responses": [
        "Hello! How can I assist you with volunteering today?",
        "Hi there! Ready to help you find a volunteering opportunity.",
        "Hey! What volunteer opportunity are you looking for today?",
        "Hello! How can I help you get involved with volunteering?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye",
        "Catch you later",
        "Take care"
      ],
      "responses": [
        "Goodbye! Thanks for considering to volunteer.",
        "See you later! Don't forget to volunteer!",
        "Take care! We're always here when you're ready to volunteer.",
        "Farewell! Hope to see you again soon!"
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "That's helpful",
        "Thank you so much!",
        "I appreciate your help"
      ],
      "responses": [
        "You're welcome! Happy to help you find volunteering opportunities.",
        "Anytime! Let me know if you need further assistance.",
        "Glad I could assist! Reach out if you have more questions.",
        "You're very welcome! Let me know if there's anything else I can do."
      ]
    },
    {
      "tag": "volunteer_opportunities",
      "patterns": [
        "What volunteer opportunities are available?",
        "Tell me about volunteer opportunities",
        "I want to volunteer, what can I do?",
        "Show me volunteer opportunities",
        "What can I volunteer for?",
        "Give me some volunteer options",
        "What are the volunteer opportunities?",
        "What volunteering events can I join?"
      ],
      "responses": [
        "Here are some volunteer opportunities: [List opportunities]. Please tell me your location and availability.",
        "Let me find some volunteering activities for you! Please provide your location and availability.",
        "You can volunteer in these events: [List opportunities]. Where are you located, and what times are you available?",
        "We have several volunteer events listed. Share your availability, and I'll suggest the best options."
      ]
    },
    {
      "tag": "volunteer_registration",
      "patterns": [
        "How can I register for an event?",
        "Can I register for a volunteer opportunity?",
        "I want to sign up for a volunteering event",
        "How do I join an event?",
        "How do I register for volunteering?"
      ],
      "responses": [
        "To register, let me know the event you'd like to join, and I'll assist you.",
        "Please provide the event ID or title you'd like to register for.",
        "Tell me which event you're interested in, and I'll guide you through the registration process.",
        "I'd be happy to help you register for a volunteer event! What event are you interested in?"
      ]
    },
    {
      "tag": "volunteer_remove",
      "patterns": [
        "I want to withdraw from a volunteer event",
        "Cancel my registration for the event",
        "Remove my registration",
        "Unregister me from the event",
        "I need to cancel my volunteer registration"
      ],
      "responses": [
        "Your registration has been successfully removed from the event.",
        "You're no longer registered for this event. Hope to see you next time!",
        "You have been successfully unregistered from the event. Let me know if you need assistance with anything else.",
        "We've removed your registration. Feel free to reach out if you'd like to join a different event!"
      ]
    },
    {
      "tag": "event_feedback",
      "patterns": [
        "Can I leave feedback for the event?",
        "How can I provide feedback on an event?",
        "I want to rate my volunteer experience",
        "How do I leave a review for a volunteering event?",
        "Can I submit my feedback for the event?"
      ],
      "responses": [
        "Please share your feedback with us, and we'll make sure to improve our events.",
        "We'd love to hear your thoughts. What was your experience like?",
        "Your feedback is valuable! Feel free to share your thoughts about the event.",
        "Tell us how we can improve! We welcome all your feedback about the event."
      ]
    },
    {
      "tag": "event_details",
      "patterns": [
        "Tell me more about the event",
        "What is the event about?",
        "Give me more details about the volunteer event",
        "What does the event involve?",
        "Can you provide more info about the volunteer activity?"
      ],
      "responses": [
        "Here's more information about the event: [Event details]. Let me know if you'd like to register!",
        "The event includes [Event details]. Let me know if you're interested!",
        "This is the description of the event: [Event details]. Would you like to join?",
        "The event details are as follows: [Event details]. Let me know if you'd like to participate!"
      ]
    },
    {
      "tag": "error",
      "patterns": [
        "I didn't understand that",
        "Can you help me again?",
        "Sorry, I don't get it",
        "I don't know what you're asking",
        "Can you clarify?"
      ],
      "responses": [
        "Sorry, I didn't quite catch that. Could you rephrase?",
        "I didn't understand that. Can you try again?",
        "Sorry, I'm not sure what you mean. Could you please clarify?",
        "I didn't quite get that. Can you explain a bit more?"
      ]
    },
    {
      "tag": "location_request",
      "patterns": [
        "Where are you located?",
        "What is your location?",
        "Where can I find you?",
        "Where are you based?"
      ],
      "responses": [
        "I am here to assist you virtually, no matter where you are! Just let me know your location for volunteering opportunities.",
        "I am available online. Share your location so I can help you find nearby volunteer opportunities.",
        "I am available online, but I can help you based on your location. Where are you based?"
      ]
    }
  ]
}
